{
  "general": "General settings",
  "notifications": "Notifications",
  "dark_mode": "Dark Mode",
  "language": "Language",
  "clear_cache": "Clear App Cache",
  "cache_cleared": "Cache cleared successfully",
  "sign_in_with_google": "Sign in with Google",
  "login_agreement": "By continuing, you agree to our terms of service and allow YTOX to monitor your YouTube comments for toxic or abusive language.",
  "app_title": "YTOX",
  "about": "About YTOX",
  "sign_out": "Sign Out",
  "account": "Account",
  "no_toxic_comments": "No toxic comments found",
  "no_connection": "No internet connection",
  "retry": "Retry",
  "comments": "Comments",
  "privacy_policy":"Privacy Policy",
  "terms_of_service": "Terms of Service",
  "how_works": "How YTOX Works",
  "rate_this_app": "Rate this App",
  "share": "Share YTOX",
  "licenses": "Open Source Licenses",
  "contact_support": "Contact Support",
  "hyw1": "YTOX helps you detect toxic or abusive language in your YouTube comments using AI models.",
  "hwt1": "🔍 1. Comment Analysis",
  "hw1": "After signing in with Google, YTOX scans the latest comments from your YouTube videos.",
  "hwt2": "🤖 2. Toxicity Detection",
  "hw2": "Using machine learning, the app checks each comment for signs of toxicity, hate speech, or harassment.",
  "hwt3": "📊 3. Alerts & Reports",
  "hw3": "YTOX flags harmful comments and shows them clearly so you can decide how to act.",
  "hwt4": "🔒 4. Privacy First",
  "hw4": "We don’t store your personal data or comments. Everything runs securely on your device or via verified APIs.",
  "pyp": "YTOX respects your privacy. This privacy policy outlines how your data is collected, used, and protected.",
  "ppt1": "1. Data Collection",
  "pp1": "We only collect your public YouTube comments when you log in. No private data is accessed.",
  "ppt2": "2. Usage of Data",
  "pp2": "The collected comments are analyzed for toxic content using machine learning models. No data is shared with third parties.",
  "ppt3": "3. Your Consent",
  "pp3": "By using YTOX, you consent to the terms of this privacy policy.",
  "ppt4": "4. Contact",
  "pp4": "If you have any questions or concerns, contact us at ytox.app@gmail.com.",
  "tys": "These terms govern your use of the YTOX app. By using the app, you agree to comply with them.",
  "tst1": "1. Use of Service",
  "ts1": "YTOX is designed to analyze public YouTube comments for toxic language. You agree to use it responsibly and legally.",
  "tst2": "2. Account and Data",
  "ts2": "You must be logged in with your Google account to access comment analysis. Your data is handled according to our privacy policy.",
  "tst3": "3. Modifications and Termination",
  "ts3": "We may update or discontinue the app at any time without notice. You can stop using it at any time.",
  "tst4": "4. Liability Disclaimer",
  "ts4": "YTOX is provided \"as is\" without warranties of any kind. We are not responsible for any losses or damages.",
  "error": "Could not open email app"
}
