{
  "general": "Paramètres généraux",
  "notifications": "Notifications",
  "dark_mode": "Mode sombre",
  "language": "Langue",
  "clear_cache": "Effacer le cache",
  "cache_cleared": "Cache vidé avec succès",
  "sign_in_with_google": "Se connecter avec Google",
  "login_agreement": "En continuant, vous acceptez nos conditions d'utilisation et autorisez YTOX à surveiller vos commentaires YouTube pour un langage toxique ou abusif.",
  "app_title": "YTOX",
  "about": "À propos de YTOX",
  "sign_out": "Se déconnecter",
  "account": "Compte",
  "no_toxic_comments": "Aucun commentaire toxique trouvé",
  "no_connection": "Pas de connexion Internet",
  "retry": "Réessayer",
  "comments": "Commentaires",
  "privacy_policy": "Politique de confidentialité",
  "terms_of_service": "Conditions d'utilisation",
  "how_works": "Comment fonctionne YTOX",
  "rate_this_app": "Noter cette application",
  "share": "Partager YTOX",
  "licenses": "Licences open source",
  "contact_support": "Contacter le support",
  "hyw1": "YTOX vous aide à détecter un langage toxique ou abusif dans vos commentaires YouTube grâce à l'IA.",
  "hwt1": "🔍 1. Analyse des commentaires",
  "hw1": "Après vous être connecté avec Google, YTOX analyse les derniers commentaires de vos vidéos YouTube.",
  "hwt2": "🤖 2. Détection de toxicité",
  "hw2": "Grâce à l'apprentissage automatique, l'application détecte les signes de toxicité, discours haineux ou harcèlement.",
  "hwt3": "📊 3. Alertes et rapports",
  "hw3": "YTOX signale les commentaires nuisibles et les affiche clairement pour que vous puissiez agir.",
  "hwt4": "🔒 4. Confidentialité avant tout",
  "hw4": "Nous ne stockons pas vos données personnelles ni vos commentaires. Tout fonctionne en toute sécurité sur votre appareil ou via des API vérifiées.",
  "pyp": "YTOX respecte votre vie privée. Cette politique de confidentialité explique comment vos données sont collectées, utilisées et protégées.",
  "ppt1": "1. Collecte de données",
  "pp1": "Nous collectons uniquement vos commentaires YouTube publics lors de la connexion. Aucune donnée privée n'est accessible.",
  "ppt2": "2. Utilisation des données",
  "pp2": "Les commentaires collectés sont analysés pour détecter un contenu toxique à l'aide de modèles d'IA. Aucune donnée n'est partagée avec des tiers.",
  "ppt3": "3. Votre consentement",
  "pp3": "En utilisant YTOX, vous acceptez les termes de cette politique de confidentialité.",
  "ppt4": "4. Contact",
  "pp4": "Pour toute question ou préoccupation, contactez-nous à ytox.app@gmail.com.",
  "tys": "Ces conditions régissent votre utilisation de l'application YTOX. En l'utilisant, vous acceptez de vous y conformer.",
  "tst1": "1. Utilisation du service",
  "ts1": "YTOX est conçu pour analyser les commentaires publics de YouTube. Vous acceptez de l'utiliser de manière responsable et légale.",
  "tst2": "2. Compte et données",
  "ts2": "Vous devez être connecté avec votre compte Google pour accéder à l'analyse. Vos données sont traitées selon notre politique de confidentialité.",
  "tst3": "3. Modifications et résiliation",
  "ts3": "Nous pouvons modifier ou arrêter l'application à tout moment sans préavis. Vous pouvez cesser de l'utiliser à tout moment.",
  "tst4": "4. Exclusion de responsabilité",
  "ts4": "YTOX est fourni \"tel quel\" sans garantie. Nous ne sommes pas responsables des pertes ou dommages.",
  "error": "Impossible d'ouvrir l'application e-mail"
}
